Raw-wrk-files/run-3/update/gemini/raw
Welcome to Ubuntu 12.04.3 LTS (GNU/Linux 3.9.0-030900-generic x86_64)

 * Documentation:  https://help.ubuntu.com/

  System information as of Mon Oct 21 11:23:00 PDT 2013

  System load:  0.22               Processes:           119
  Usage of /:   5.8% of 129.62GB   Users logged in:     0
  Memory usage: 3%                 IP address for eth1: 172.16.98.98
  Swap usage:   0%

  Graph this data and manage this system at https://landscape.canonical.com/

64 packages can be updated.
24 updates are security updates.


---------------------------------------------------------
 Running Primer gemini
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 5 -c 8 -t 8 http://tfbapp:8080/update?queries=2
---------------------------------------------------------

Running 5s test @ http://tfbapp:8080/update?queries=2
  8 threads and 8 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.03ms  721.71us  27.43ms   99.58%
    Req/Sec     1.04k   114.76     1.44k    75.31%
  39315 requests in 5.00s, 7.89MB read
Requests/sec:   7862.18
Transfer/sec:      1.58MB

---------------------------------------------------------
 Running Warmup gemini
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 15 -c 256 -t 8 http://tfbapp:8080/update?queries=2
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/update?queries=2
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    12.01ms   10.80ms 328.03ms   81.00%
    Req/Sec     2.73k   367.09     4.09k    70.58%
  322629 requests in 15.00s, 64.78MB read
Requests/sec:  21508.52
Transfer/sec:      4.32MB

---------------------------------------------------------
 Queries: 1 for gemini
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 15 -c 256 -t 8 http://tfbapp:8080/update?queries=1
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/update?queries=1
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.61ms    9.92ms 241.68ms   92.79%
    Req/Sec     5.45k     1.18k    9.65k    78.89%
  637007 requests in 15.00s, 108.61MB read
Requests/sec:  42468.46
Transfer/sec:      7.24MB

---------------------------------------------------------
 Queries: 5 for gemini
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 15 -c 256 -t 8 http://tfbapp:8080/update?queries=5
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/update?queries=5
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    30.10ms   15.86ms 190.01ms   76.31%
    Req/Sec     1.07k   126.66     1.36k    82.79%
  127796 requests in 15.00s, 37.40MB read
Requests/sec:   8518.92
Transfer/sec:      2.49MB

---------------------------------------------------------
 Queries: 10 for gemini
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 15 -c 256 -t 8 http://tfbapp:8080/update?queries=10
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/update?queries=10
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    60.42ms   25.17ms 282.93ms   77.90%
    Req/Sec   528.77     67.96   765.00     83.94%
  63168 requests in 15.00s, 28.06MB read
Requests/sec:   4211.13
Transfer/sec:      1.87MB

---------------------------------------------------------
 Queries: 15 for gemini
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 15 -c 256 -t 8 http://tfbapp:8080/update?queries=15
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/update?queries=15
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    89.18ms   27.53ms 240.51ms   74.40%
    Req/Sec   355.09     34.77   427.00     78.80%
  42548 requests in 15.00s, 25.35MB read
Requests/sec:   2835.72
Transfer/sec:      1.69MB

---------------------------------------------------------
 Queries: 20 for gemini
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 15 -c 256 -t 8 http://tfbapp:8080/update?queries=20
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/update?queries=20
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   119.55ms   33.59ms 377.38ms   73.16%
    Req/Sec   265.67     27.80   317.00     78.03%
  31898 requests in 15.03s, 23.84MB read
Requests/sec:   2122.77
Transfer/sec:      1.59MB